In [1]:
import numpy as np
import pandas as pd

# 5.2 Essential Functionality

In [4]:
s1 = pd.Series([10,20,30],index=[2,4,6])
s1

2    10
4    20
6    30
dtype: int64

In [6]:
s1.reindex([1,2,3,4,5])

1     NaN
2    10.0
3     NaN
4    20.0
5     NaN
dtype: float64

In [7]:
s2 = s1.reindex([2,4,6,8,10])
s2

2     10.0
4     20.0
6     30.0
8      NaN
10     NaN
dtype: float64

In [8]:
s3 = pd.Series(['blue','purple','green'],index = [10,20,30])
s3

10      blue
20    purple
30     green
dtype: object

In [9]:
s4 = s3.reindex([10,15,20,25,30,35,40,45],method='ffill')
s4

10      blue
15      blue
20    purple
25    purple
30     green
35     green
40     green
45     green
dtype: object

In [10]:
s5 = s3.reindex([10,15,20,25,30,35,40,45],method='bfill')
s5

10      blue
15    purple
20    purple
25     green
30     green
35       NaN
40       NaN
45       NaN
dtype: object

In [12]:
s6 = pd.DataFrame({'Name':['Kulsoom','Hamdah'],
                   'age':[20,19],
                   'marks':[100,200]},index=['a','b'])
s6

      Name  age  marks
a  Kulsoom   20    100
b   Hamdah   19    200

#### We can also add new row(index)

In [13]:
s6.reindex(['a','b',5])

      Name   age  marks
a  Kulsoom  20.0  100.0
b   Hamdah  19.0  200.0
5      NaN   NaN    NaN

In [18]:
s6.set_value(5, 'marks', 10)

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """Entry point for launching an IPython kernel.

      Name   age  marks
a  Kulsoom  20.0  300.0
b   Hamdah  19.0  300.0
5      NaN   NaN   10.0

In [19]:
s6

      Name   age  marks
a  Kulsoom  20.0  300.0
b   Hamdah  19.0  300.0
5      NaN   NaN   10.0

In [20]:
s6.ix[5,'age']=15
s6

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

      Name   age  marks
a  Kulsoom  20.0  300.0
b   Hamdah  19.0  300.0
5      NaN  15.0   10.0

#### Another method of inserting a row

In [9]:
s7 = pd.DataFrame({'Ename':['Anas','Monis'],
                   'salary':[100000,20000]})
s7

   Ename  salary
0   Anas  100000
1  Monis   20000

In [7]:
dict1 = { 'Ename':'Kulsoom',
          'salary':10000}
dict1

{'Ename': 'Kulsoom', 'salary': 10000}

In [10]:
s7=s7.append(dict1,ignore_index=True)
s7

     Ename  salary
0     Anas  100000
1    Monis   20000
2  Kulsoom   10000

#### Another method of inserting a row

In [83]:
s7.loc[3]=['Mateen',20000]
s7

     Ename  salary
0     Anas  100000
1    Monis   20000
2  Kulsoom   10000
3   Mateen   20000

#### Deleting a row

In [34]:
s7.drop([2])

     Ename  salary
0     Anas  100000
1    Monis   20000
3  Kulsoom   10000

In [38]:
dict2={'AI for everyone':[90,88,87,67,94,100],
       'Python1':[89,78,56,98,90,88],
       'Python2':[90,67,56,98,70,82]}
df1 = pd.DataFrame(dict2,index=['a','b','c','d','e','f'])
df1

   AI for everyone  Python1  Python2
a               90       89       90
b               88       78       67
c               87       56       56
d               67       98       98
e               94       90       70
f              100       88       82

In [58]:
df1['Total']=df1['AI for everyone']+df1['Python1']+df1['Python2']
df1

   AI for everyone  Python1  Python2  Total Status  Percentage
0             90.0     89.0     90.0  269.0   Pass   89.666667
1             88.0     78.0     67.0  233.0   Pass   77.666667
2             87.0     56.0     56.0  199.0   Pass   66.333333
3             67.0     98.0     98.0  263.0   Pass   87.666667
4             94.0     90.0     70.0  254.0   Pass   84.666667
5            100.0     88.0     82.0  270.0   Pass   90.000000
6             23.0     45.0     56.0  124.0   Fail         NaN

In [40]:
df1['Status']=['Pass' if a>=33 and p1>=33 and p2>33 else 'Fail' for a,p1,p2 in zip(df1['AI for everyone'],df1['Python1'],df1['Python2'])]
df1

   AI for everyone  Python1  Python2  Total Status
a               90       89       90    269   Pass
b               88       78       67    233   Pass
c               87       56       56    199   Pass
d               67       98       98    263   Pass
e               94       90       70    254   Pass
f              100       88       82    270   Pass

In [53]:
dict3 = {'AI for everyone':23,'Python1':45,'Python2':56}
df1=df1.append(dict3,ignore_index=True)
df1

   AI for everyone  Python1  Python2  Total Status  Percentage
0             90.0     89.0     90.0  269.0   Pass   89.666667
1             88.0     78.0     67.0  233.0   Pass   77.666667
2             87.0     56.0     56.0  199.0   Pass   66.333333
3             67.0     98.0     98.0  263.0   Pass   87.666667
4             94.0     90.0     70.0  254.0   Pass   84.666667
5            100.0     88.0     82.0  270.0   Pass   90.000000
6             23.0     45.0     56.0    NaN    NaN         NaN

In [46]:
df1=df1.drop([6])
df1

   AI for everyone  Python1  Python2  Total Status  Percentage
0             90.0     89.0     90.0  269.0   Pass   89.666667
1             88.0     78.0     67.0  233.0   Pass   77.666667
2             87.0     56.0     56.0  199.0   Pass   66.333333
3             67.0     98.0     98.0  263.0   Pass   87.666667
4             94.0     90.0     70.0  254.0   Pass   84.666667
5            100.0     88.0     82.0  270.0   Pass   90.000000

In [59]:
df1['Status']=['Pass' if a>=33 and p1>=33 and p2>33 else 'Fail' for a,p1,p2 in zip(df1['AI for everyone'],df1['Python1'],df1['Python2'])]
df1

   AI for everyone  Python1  Python2  Total Status  Percentage
0             90.0     89.0     90.0  269.0   Pass   89.666667
1             88.0     78.0     67.0  233.0   Pass   77.666667
2             87.0     56.0     56.0  199.0   Pass   66.333333
3             67.0     98.0     98.0  263.0   Pass   87.666667
4             94.0     90.0     70.0  254.0   Pass   84.666667
5            100.0     88.0     82.0  270.0   Pass   90.000000
6             23.0     45.0     56.0  124.0   Fail         NaN

In [60]:
df1['Percentage']=(df1['Total']/300)*100
df1

   AI for everyone  Python1  Python2  Total Status  Percentage
0             90.0     89.0     90.0  269.0   Pass   89.666667
1             88.0     78.0     67.0  233.0   Pass   77.666667
2             87.0     56.0     56.0  199.0   Pass   66.333333
3             67.0     98.0     98.0  263.0   Pass   87.666667
4             94.0     90.0     70.0  254.0   Pass   84.666667
5            100.0     88.0     82.0  270.0   Pass   90.000000
6             23.0     45.0     56.0  124.0   Fail   41.333333

In [61]:
df1.head()

   AI for everyone  Python1  Python2  Total Status  Percentage
0             90.0     89.0     90.0  269.0   Pass   89.666667
1             88.0     78.0     67.0  233.0   Pass   77.666667
2             87.0     56.0     56.0  199.0   Pass   66.333333
3             67.0     98.0     98.0  263.0   Pass   87.666667
4             94.0     90.0     70.0  254.0   Pass   84.666667

In [62]:
df1.head(2)

   AI for everyone  Python1  Python2  Total Status  Percentage
0             90.0     89.0     90.0  269.0   Pass   89.666667
1             88.0     78.0     67.0  233.0   Pass   77.666667

In [63]:
df1.tail()

   AI for everyone  Python1  Python2  Total Status  Percentage
2             87.0     56.0     56.0  199.0   Pass   66.333333
3             67.0     98.0     98.0  263.0   Pass   87.666667
4             94.0     90.0     70.0  254.0   Pass   84.666667
5            100.0     88.0     82.0  270.0   Pass   90.000000
6             23.0     45.0     56.0  124.0   Fail   41.333333

In [64]:
df1.tail(3)

   AI for everyone  Python1  Python2  Total Status  Percentage
4             94.0     90.0     70.0  254.0   Pass   84.666667
5            100.0     88.0     82.0  270.0   Pass   90.000000
6             23.0     45.0     56.0  124.0   Fail   41.333333

#### Retrieving a particular row

In [65]:
df1.loc[4]

AI for everyone         94
Python1                 90
Python2                 70
Total                  254
Status                Pass
Percentage         84.6667
Name: 4, dtype: object

In [66]:
#in loc we can also define indexes like A,B,C other than numbers and it also inlude 4 i.e last number in slice
df1.loc[2:4]

   AI for everyone  Python1  Python2  Total Status  Percentage
2             87.0     56.0     56.0  199.0   Pass   66.333333
3             67.0     98.0     98.0  263.0   Pass   87.666667
4             94.0     90.0     70.0  254.0   Pass   84.666667

In [67]:
df1.iloc[3]

AI for everyone         67
Python1                 98
Python2                 98
Total                  263
Status                Pass
Percentage         87.6667
Name: 3, dtype: object

In [68]:
#in iloc we only give number indexes and it does not include last value
df1.iloc[2:5]

   AI for everyone  Python1  Python2  Total Status  Percentage
2             87.0     56.0     56.0  199.0   Pass   66.333333
3             67.0     98.0     98.0  263.0   Pass   87.666667
4             94.0     90.0     70.0  254.0   Pass   84.666667

In [94]:
df2=pd.DataFrame({'Roll no':[1,2,3],
                 'Marks':[100,90,80]},index=['A','B','C'])
df2

   Roll no  Marks
A        1    100
B        2     90
C        3     80

In [95]:
df2.loc['B']

Roll no     2
Marks      90
Name: B, dtype: int64

In [96]:
df2.loc['A':'C']

   Roll no  Marks
A        1    100
B        2     90
C        3     80

In [97]:
df2.iloc[2]

Roll no     3
Marks      80
Name: C, dtype: int64

In [98]:
df2.iloc[:2]

   Roll no  Marks
A        1    100
B        2     90

In [99]:
df2.iloc[::-1]

   Roll no  Marks
C        3     80
B        2     90
A        1    100

In [100]:
df2.loc['D']=[4,89]
df2

   Roll no  Marks
A        1    100
B        2     90
C        3     80
D        4     89

In [101]:
df1.loc[4]['Python1']

90.0

In [102]:
df1.iloc[4]['AI for everyone']

94.0

In [103]:
df1

   AI for everyone  Python1  Python2  Total Status  Percentage
0             90.0     89.0     90.0  269.0   Pass   89.666667
1             88.0     78.0     67.0  233.0   Pass   77.666667
2             87.0     56.0     56.0  199.0   Pass   66.333333
3             67.0     98.0     98.0  263.0   Pass   87.666667
4             94.0     90.0     70.0  254.0   Pass   84.666667
5            100.0     88.0     82.0  270.0   Pass   90.000000
6             23.0     45.0     56.0  124.0   Fail   41.333333

In [104]:
df2

   Roll no  Marks
A        1    100
B        2     90
C        3     80
D        4     89

In [106]:
df2.reindex(['A','E','B','C','I','O','D','U'])

   Name  Roll no  Marks
A   NaN      1.0  100.0
E   NaN      NaN    NaN
B   NaN      2.0   90.0
C   NaN      3.0   80.0
I   NaN      NaN    NaN
O   NaN      NaN    NaN
D   NaN      4.0   89.0
U   NaN      NaN    NaN

In [108]:
df2=df2.reindex(columns=['Name','Roll no','Marks'])
df2

   Name  Roll no  Marks
A   NaN        1    100
B   NaN        2     90
C   NaN        3     80
D   NaN        4     89

In [113]:
df2.loc['A','Name']=['Hanifa']
df2

     Name  Roll no  Marks
A  Hanifa        1    100
B     NaN        2     90
C     NaN        3     80
D     NaN        4     89

In [115]:
df2.loc['B','Name']='Sumayyah'
df2.loc['C','Name']='Nimrah'
df2.loc['D','Name']='Haniya'

In [116]:
df2

       Name  Roll no  Marks
A    Hanifa        1    100
B  Sumayyah        2     90
C    Nimrah        3     80
D    Haniya        4     89

In [117]:
df2.loc[['B','D']]

       Name  Roll no  Marks
B  Sumayyah        2     90
D    Haniya        4     89

#### Dropping enteries from an axis

In [120]:
df2=df2.drop(['A','C'])

In [121]:
df2

       Name  Roll no  Marks
B  Sumayyah        2     90
D    Haniya        4     89

In [122]:
#values can be dropped from any axis but by default it will drop x axis values

In [125]:
#dropping y axis
df2.drop('Roll no',axis='columns')

       Name  Marks
B  Sumayyah     90
D    Haniya     89

In [127]:
df2['Urdu']=0
df2['English']=1
df2

       Name  Roll no  Marks  Urdu  English
B  Sumayyah        2     90     0        1
D    Haniya        4     89     0        1

In [129]:
df2.drop(['Urdu','English'],axis='columns')

       Name  Roll no  Marks
B  Sumayyah        2     90
D    Haniya        4     89

#### Indexing,Seletion and filtering

In [130]:
s8 = pd.Series([1,2,3,4],index=['a','b','c','d'])

In [131]:
s8

a    1
b    2
c    3
d    4
dtype: int64

In [132]:
s8['a']

1

In [134]:
s8[['a','c']]

a    1
c    3
dtype: int64

In [135]:
s8[1]

2

In [136]:
s8[[1,3]]

b    2
d    4
dtype: int64

In [141]:
s8[s8<3]

a    1
b    2
dtype: int64

In [142]:
#Slicing with labels behaves differently than normal Python slicing in that the endpoint is inclusive:
s8['b':'c']

b    2
c    3
dtype: int64

In [143]:
s8['b':'d']=100

In [150]:
s8

a      1
b    100
c    100
d    100
dtype: int64

In [159]:
df3 = pd.DataFrame(np.arange(16).reshape((4,4)),columns=['one','two','three','four'],index=['Pak','SL','ENG','AUS'])

In [160]:
df3

     one  two  three  four
Pak    0    1      2     3
SL     4    5      6     7
ENG    8    9     10    11
AUS   12   13     14    15

In [161]:
df3[df3['four']>10]

     one  two  three  four
ENG    8    9     10    11
AUS   12   13     14    15

In [162]:
df3[df3<5]=0

In [163]:
df3

     one  two  three  four
Pak    0    0      0     0
SL     0    5      6     7
ENG    8    9     10    11
AUS   12   13     14    15

#### Selection with loc and iloc

In [164]:
#select a single row and multiple columns by label
df3.loc['Pak',['one','three']]

one      0
three    0
Name: Pak, dtype: int32

In [165]:
#select a single column and multiple rows by label
df3.loc[['Pak','ENG'],'four']

Pak     0
ENG    11
Name: four, dtype: int32

In [166]:
df3.iloc[3,[1,2]]

two      13
three    14
Name: AUS, dtype: int32

In [167]:
df3.iloc[[2,3],[1,2]]

     two  three
ENG    9     10
AUS   13     14

In [168]:
df3.loc[:,'four']

Pak     0
SL      7
ENG    11
AUS    15
Name: four, dtype: int32

In [169]:
df3.loc['AUS',::-1]

four     15
three    14
two      13
one      12
Name: AUS, dtype: int32

In [171]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

#### Arithmetic and data alignment

In [172]:
s9=pd.Series([2,6,3,7],index=['a','c','d','f'])
s10=pd.Series([4,8,2,0],index=['b','c','d','e'])
s9+s10

a     NaN
b     NaN
c    14.0
d     5.0
e     NaN
f     NaN
dtype: float64

In [175]:
df4 = pd.DataFrame(np.arange(9).reshape(3,3),columns=list('abc'),index=['Pak','ENG','AUS'])
df4

     a  b  c
Pak  0  1  2
ENG  3  4  5
AUS  6  7  8

In [176]:
df5=pd.DataFrame(np.arange(12).reshape(4,3),columns=list('bcd'),index=['Pak','ENG','AUS','SL'])
df5

     b   c   d
Pak  0   1   2
ENG  3   4   5
AUS  6   7   8
SL   9  10  11

In [177]:
#the arrangement of indexes/labels is as per alphabetical order.
df4+df5

      a     b     c   d
AUS NaN  13.0  15.0 NaN
ENG NaN   7.0   9.0 NaN
Pak NaN   1.0   3.0 NaN
SL  NaN   NaN   NaN NaN

In [178]:
#If you add DataFrame objects with no column or row labels in common, the result will contain all nulls
df6=pd.DataFrame({'A':[1,2],
                  'B':[3,4]})
df7=pd.DataFrame({'C':[5,6],
                  'D':[7,8]})
df6-df7

    A   B   C   D
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN

In [182]:
df6

   A  B
0  1  3
1  2  4

In [187]:
df8=pd.DataFrame({'a':[1,2],
                  'b':[3,4]},columns=['a','b'])
df9=pd.DataFrame({'b':[5,6],
                  'c':[7,8]},columns=['b','c'])
df9-df8

    a  b   c
0 NaN  2 NaN
1 NaN  2 NaN

In [185]:
df8

   a  b
0  1  3
1  2  4

In [186]:
df9

   b  c
0  5  7
1  6  8

In [188]:
df8+df9

    a   b   c
0 NaN   8 NaN
1 NaN  10 NaN

#### Arithmetic methods with fill values

In [194]:
df10=pd.DataFrame(np.arange(12).reshape(3,4),columns=['a','b','c','d'])
df11=pd.DataFrame(np.arange(20).reshape(4,5),columns=['a','b','c','d','e'])
df10

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [195]:
df11

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [196]:
df10

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [198]:
df10.loc[1,'b']=np.nan

In [199]:
df10

   a    b   c   d
0  0  1.0   2   3
1  4  NaN   6   7
2  8  9.0  10  11

In [200]:
df10+df11

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [202]:
df10.add(df11)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [203]:
df10.add(df11,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   6.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [ ]:
#a listing of Series and DataFrame methods for arithmetic. Each of them has a counterpart, starting with the letter r, 
(#that has arguments flipped. So these two statements are equivalent(1/df10 and df10.rdiv(1))

In [204]:
1/df10

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250       NaN  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [207]:
df10.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250       NaN  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [209]:
df10.reindex(columns=df11.columns,fill_value=0)

   a    b   c   d  e
0  0  1.0   2   3  0
1  4  NaN   6   7  0
2  8  9.0  10  11  0

In [210]:
df10

   a    b   c   d
0  0  1.0   2   3
1  4  NaN   6   7
2  8  9.0  10  11

#### Operations between DataFrame and Series

In [212]:
df12=pd.DataFrame(np.arange(12).reshape(3,4),columns=list('bcde'),index=['Pak','Eng','Aus'])
df12

     b  c   d   e
Pak  0  1   2   3
Eng  4  5   6   7
Aus  8  9  10  11

In [214]:
seeries=df12.iloc[0]
seeries

b    0
c    1
d    2
e    3
Name: Pak, dtype: int32

In [215]:
df12-seeries

     b  c  d  e
Pak  0  0  0  0
Eng  4  4  4  4
Aus  8  8  8  8

In [224]:
s11=pd.Series(range(4),index=['b','e','f','g'])
s11

b    0
e    1
f    2
g    3
dtype: int64

In [225]:
df12+s11

       b   c   d     e   f   g
Pak  0.0 NaN NaN   4.0 NaN NaN
Eng  4.0 NaN NaN   8.0 NaN NaN
Aus  8.0 NaN NaN  12.0 NaN NaN

In [232]:
s12=df12['d']
s12

Pak     2
Eng     6
Aus    10
Name: d, dtype: int32

In [231]:
df12.sub(s12,axis='index')

     b  c  d  e
Pak -2 -1  0  1
Eng -2 -1  0  1
Aus -2 -1  0  1

In [229]:
df12

     b  c   d   e
Pak  0  1   2   3
Eng  4  5   6   7
Aus  8  9  10  11

#### Function Application and Mapping

In [233]:
df13 = pd.DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Pak','Eng','Aus','SL'])
df13

            b         d         e
Pak -2.041507 -0.305168  0.346252
Eng -0.990321  0.616007  0.688490
Aus  0.598895  0.024769  1.598877
SL   0.084765  0.478899 -0.914135

In [237]:
df13=df13.abs()

In [238]:
df13

            b         d         e
Pak  2.041507  0.305168  0.346252
Eng  0.990321  0.616007  0.688490
Aus  0.598895  0.024769  1.598877
SL   0.084765  0.478899  0.914135

#### Lambda function

In [240]:
f=lambda x:x.max()-x.min()
df12.apply(f)

b    8
c    8
d    8
e    8
dtype: int64

In [242]:
f1=lambda y:y.max()
df12.apply(f1)

b     8
c     9
d    10
e    11
dtype: int64

In [243]:
#If you pass axis='columns' to apply, the function will be invoked once per row instead
df12.apply(f1,axis='columns')

Pak     3
Eng     7
Aus    11
dtype: int64

In [244]:
df12

     b  c   d   e
Pak  0  1   2   3
Eng  4  5   6   7
Aus  8  9  10  11

In [251]:
def f2(x):
    return pd.Series([x.max(),x.min()],index=['max','min'])
df13.apply(f2)

            b         d         e
max  2.041507  0.616007  1.598877
min  0.084765  0.024769  0.346252

In [250]:
def f2(x):
    return pd.Series([x.max(),x.min()],index=['max','min'])
f2(df13)

max    b    2.041507
d    0.616007
e    1.598877
dtyp...
min    b    0.084765
d    0.024769
e    0.346252
dtyp...
dtype: object

In [249]:
df13

            b         d         e
Pak  2.041507  0.305168  0.346252
Eng  0.990321  0.616007  0.688490
Aus  0.598895  0.024769  1.598877
SL   0.084765  0.478899  0.914135

#### Use of apply,applymap and map

In [252]:
#Apply: It is used when you want to apply a function along the axis of a dataframe, it accepts a Series whose index is either column (axis=0) or row (axis=1).
#applymap: It is used for element wise operation across one or more rows and columns of a dataframe. 
#map: It can be used only for a Series object and helps to substitutes the series value from the lookup dictionary, Series or a function and missing value will be substituted as NaN

In [253]:
df14=pd.DataFrame({'a':[1,2,3],
                   'b':[4,5,6],
                   'c':[7,8,9]},index=['A1','B1','C1'])
df14

    a  b  c
A1  1  4  7
B1  2  5  8
C1  3  6  9

In [257]:
def multiply_by_2(x):
    return x*2
df14.apply(multiply_by_2)

    a   b   c
A1  2   8  14
B1  4  10  16
C1  6  12  18

In [264]:
def multiply_col1_col2(col):
    return col['a']*col['b']
df14['col a * col b']=df14.apply(multiply_col1_col2,axis=1)

In [265]:
df14

    a  b  c  col a * col b
A1  1  4  7              4
B1  2  5  8             10
C1  3  6  9             18

In [266]:
#Applymap
df14.applymap(lambda x:x**2)

    a   b   c  col a * col b
A1  1  16  49             16
B1  4  25  64            100
C1  9  36  81            324

In [267]:
df14.applymap(lambda x:'%.2f'%x)

       a     b     c col a * col b
A1  1.00  4.00  7.00          4.00
B1  2.00  5.00  8.00         10.00
C1  3.00  6.00  9.00         18.00

In [269]:
#map
df15=pd.DataFrame({'Country':['Pakistan','China','USA'],
                  'population':[2432342,1231675,23425756]},index=['A','B','C'])
df15

    Country  population
A  Pakistan     2432342
B     China     1231675
C       USA    23425756

In [273]:
country_capital={
    'Pakistan':'Islamabad',
    'China':'Beijing',
    'USA':'Washington'
}
df15['Country_capital']=df15['Country'].map(country_capital)

In [274]:
df15

    Country  population Country_capital
A  Pakistan     2432342       Islamabad
B     China     1231675         Beijing
C       USA    23425756      Washington

#### Sorting and Ranking

In [277]:
s13=pd.Series(np.arange(4),index=['a','d','b','c'])
s13

a    0
d    1
b    2
c    3
dtype: int32

In [278]:
s13.sort_index()

a    0
b    2
c    3
d    1
dtype: int32

In [281]:
df16=pd.DataFrame(np.arange(8).reshape(2,4),columns=list('badc'),index=['three','one'])
df16.sort_index()

       b  a  d  c
one    4  5  6  7
three  0  1  2  3

In [282]:
df16

       b  a  d  c
three  0  1  2  3
one    4  5  6  7

In [283]:
df16.sort_index(axis=1)

       a  b  c  d
three  1  0  3  2
one    5  4  7  6

In [284]:
df16.sort_index(axis=1,ascending=False)

       d  c  b  a
three  2  3  0  1
one    6  7  4  5

In [285]:
df16.sort_values

<bound method DataFrame.sort_values of        b  a  d  c
three  0  1  2  3
one    4  5  6  7>

In [289]:
s14=pd.Series([4,3,np.nan,8,np.nan,1])
s14.sort_values()

5    1.0
1    3.0
0    4.0
3    8.0
2    NaN
4    NaN
dtype: float64

In [290]:
df17 = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
df17

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [292]:
df17.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [293]:
df17.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [296]:
s14

0    4.0
1    3.0
2    NaN
3    8.0
4    NaN
5    1.0
dtype: float64

In [298]:
s14.sort_values()

5    1.0
1    3.0
0    4.0
3    8.0
2    NaN
4    NaN
dtype: float64

In [299]:
s14.rank()

0    3.0
1    2.0
2    NaN
3    4.0
4    NaN
5    1.0
dtype: float64

In [300]:
s14.rank(method='first')

0    3.0
1    2.0
2    NaN
3    4.0
4    NaN
5    1.0
dtype: float64

In [302]:
s15 = pd.Series([7, -5, 7, 4, 2, 0, 4])
s15

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [303]:
s15.sort_values()

1   -5
5    0
4    2
3    4
6    4
0    7
2    7
dtype: int64

In [304]:
s15.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [305]:
s15.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [311]:
df18=pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                       'c': [-2, 5, 8, -2.5]})
df18

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [312]:
df18.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [314]:
df18.rank(method='first')

     b    a    c
0  3.0  1.0  2.0
1  4.0  3.0  3.0
2  1.0  2.0  4.0
3  2.0  4.0  1.0

In [313]:
df18.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

#### Axis Indexes with Duplicate Labels

In [318]:
s16=pd.Series(np.arange(6),index=['a','a','b','b','b','c'])
s16

a    0
a    1
b    2
b    3
b    4
c    5
dtype: int32

In [320]:
s16.index.is_unique

False

In [321]:
s16['a']

a    0
a    1
dtype: int32

In [324]:
df19=pd.DataFrame(np.arange(10).reshape(5,2),index=['a','b','a','c','b'])
df19

   0  1
a  0  1
b  2  3
a  4  5
c  6  7
b  8  9

In [326]:
df19.loc['a']

   0  1
a  0  1
a  4  5

In [327]:
df20= pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'],columns=['one', 'two'])
df20

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [328]:
df20.sum()

one    9.25
two   -5.80
dtype: float64

In [329]:
df20.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [331]:
df20.sum(axis='columns',skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

##### idxmax and idxmin

In [ ]:
#idxmin and idxmax, return indirect statistics like the index value where the minimum or maximum values are attained

In [332]:
df20.idxmax()

one    b
two    d
dtype: object

In [333]:
df20

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [334]:
df20.idxmin()

one    d
two    b
dtype: object

In [335]:
df19

   0  1
a  0  1
b  2  3
a  4  5
c  6  7
b  8  9

#### cumsum()

In [336]:
df19.cumsum()

    0   1
a   0   1
b   2   4
a   6   9
c  12  16
b  20  25

In [338]:
df19.cumsum(axis='columns')

   0   1
a  0   1
b  2   5
a  4   9
c  6  13
b  8  17

In [339]:
df19.describe()

              0         1
count  5.000000  5.000000
mean   4.000000  5.000000
std    3.162278  3.162278
min    0.000000  1.000000
25%    2.000000  3.000000
50%    4.000000  5.000000
75%    6.000000  7.000000
max    8.000000  9.000000

##### describe()

In [340]:
#On non-numeric data, describe produces alternative summary statistics
s17 = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [341]:
s17.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [345]:
s18=pd.Series(['a','b','c','a','a','c','b','c','a','b','b','b','d'])
s18.unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [346]:
s18.value_counts()

b    5
a    4
c    3
d    1
dtype: int64

In [348]:
pd.value_counts(s18.values,sort=False)

a    4
b    5
d    1
c    3
dtype: int64

In [349]:
s18

0     a
1     b
2     c
3     a
4     a
5     c
6     b
7     c
8     a
9     b
10    b
11    b
12    d
dtype: object

In [350]:
s18.isin(['a'])

0      True
1     False
2     False
3      True
4      True
5     False
6     False
7     False
8      True
9     False
10    False
11    False
12    False
dtype: bool

In [353]:
mask=s18.isin(['a','c'])

In [354]:
s18[mask]

0    a
2    c
3    a
4    a
5    c
7    c
8    a
dtype: object

# CHAPTER:06  Data loading, storage and file formats

## 6.1 Reading and writing data in text format

In [3]:
df20=pd.read_csv('jTeOBO.csv')
df20

,Student Code,Degree,Student Name,Mid,Quiz 1,Quiz 2,Best of Quizzes,Assignment 1,Assignment 2,Best of Assignments,Total Sessional (50),Final (50),Total (100),Grade
0,022-14-19987,BS(CS),Abdul Basit,28,8.0,3.0,8,7.0,9.0,9,45,25.0,70,B
1,022-14-110233,BS(CS),Adeel Ahmed,17,NaN,5.0,5,8.0,10.0,10,32,18.0,50,F
2,022-14-110585,BS(CS),Afrah Zareen,18,5.0,2.0,5,8.0,10.0,10,33,30.0,63,C
3,022-14-19718,BS(CS),Ahmed Ali Raza,14,7.0,2.0,7,NaN,2.0,2,23,23.0,46,F
4,022-14-110648,BS(CS),Ahsan Ali Vohra,27,7.0,6.0,7,7.0,9.0,9,43,34.0,77,B
5,022-14-110232,BS(CS),Ameer Hamza,25,9.0,6.0,9,8.0,10.0,10,44,27.0,71,B
6,022-14-110588,BS(CS),Anas Ali Khan,28,5.0,6.0,6,8.0,10.0,10,44,30.0,74,B
7,022-14-110388,BS(CS),Aneebullah Niazi,26,9.0,6.0,9,8.0,10.0,10,45,40.0,85,A
8,022-14-110601,BS(CS),Areesha Sohail,19,9.0,4.0,9,7.0,9.0,9,37,24.0,61,C
9,022-14-110599,BS(CS),Arsalan,28,8.0,6.0,8,8.0,NaN,8,44,40.0,84,A
10,022-14-110214,BS(CS),Fatima Haider Warsi,30,8.0,7.0,8,8.0,NaN,8,46,45.0,91,A
11,022-14-110591,BS(CS),Habib Ullah,28,8.0,5.0,8,5.0,NaN,5,41,35.0,76,B
12,022-15-110994,BS(CS),Hafiza Tooba Akbani,23,7.0,5.0,7,8.0,10.0,10,40,33.0,73,B
13,022-14-110600,BS(CS),Hamza Abdul Jabbar,24,8.0,4.0,8,8.0,10.0,10,42,25.0,67,C
14,022-14-110389,BS(CS),Hareem Afshan,21,7.0,4.0,7,6.0,8.0,8,36,29.0,65,C
15,022-14-19916,BS(CS),Haseeb Sajid,18,NaN,NaN,0,NaN,NaN,0,18,NaN,18,F
16,022-14-110596,BS(CS),Hassam Ahmed,23,5.0,5.0,5,7.0,9.0,9,37,35.0,72,B
17,022-14-110396,BS(CS),Khalid Anwer,20,8.0,5.0,8,9.0,11.0,11,39,31.0,70,B
18,022-14-110223,BS(CS),Madiha Jabeen,16,5.0,2.0,5,8.0,10.0,10,31,29.0,60,C
19,022-14-110222,BS(CS),Mohammad Hunain,27,9.0,6.0,9,8.0,10.0,10,46,45.0,91,A
20,022-14-110412,BS(CS),Muhammad Aamir,24,7.0,6.0,7,7.0,9.0,9,40,31.0,71,B
21,022-14-110593,BS(CS),Muhammad Abdul Rehman Siddiqui,20,9.0,6.0,9,9.0,11.0,11,40,20.0,60,C
22,022-14-110398,BS(CS),Muhammad Abdullah,20,7.0,6.0,7,7.0,NaN,7,34,23.0,57,F
23,022-14-19983,BS(CS),Muhammad Ali Iqbal,26,5.0,NaN,5,8.0,10.0,10,41,21.0,62,C
24,022-14-110215,BS(CS),Muhammad Bilal,28,5.0,4.0,5,9.0,11.0,11,44,33.0,77,B
25,022-14-110105,BS(CS),Muhammad Faraz,26,9.0,6.0,9,8.0,10.0,10,45,41.0,86,A
26,022-14-110370,BS(CS),Muhammad Ghazali Faridi,27,6.0,NaN,6,6.0,8.0,8,41,24.0,65,C
27,022-14-110452,BS(CS),Muhammad Osama Khan,27,8.0,6.0,8,8.0,10.0,10,45,26.0,71,B
28,022-14-110387,BS(CS),Muhammad Saqib Intizar,22,6.0,6.0,6,9.0,11.0,11,39,18.0,57,F
29,022-14-110217,BS(CS),Muhammad Shahroz Khurshid,17,7.0,1.0,7,6.0,NaN,6,30,9.0,39,F
30,022-14-110401,BS(CS),Muhammad Shozab,23,8.0,6.0,8,9.0,NaN,9,40,32.0,72,B
31,022-14-110231,BS(CS),Muhammad Taha Hasnain,27,7.0,5.0,7,10.0,NaN,10,44,29.0,73,B
32,022-14-110035,BS(CS),Muhammad Wajahat Khan,9,NaN,2.0,2,8.0,10.0,10,21,8.0,29,F
33,022-14-19919,BS(CS),Muhammad Younus Baig,20,4.0,2.0,4,8.0,10.0,10,34,17.0,51,F
34,022-14-110413,BS(CS),Nazeer Bin Zafar,25,9.0,6.0,9,8.0,10.0,10,44,42.0,86,A
35,022-14-19923,BS(CS),Rabi Ahmed,20,8.0,5.0,8,NaN,10.0,10,38,28.0,66,C
36,022-14-110582,BS(CS),Rida Nasim,25,9.0,5.0,9,9.0,NaN,9,43,27.0,70,B
37,022-14-110230,BS(CS),Sadaf Nosheen,27,9.0,5.0,9,9.0,NaN,9,45,30.0,75,B
38,022-14-110229,BS(CS),Sadaquat Rafique,9,6.0,6.0,6,5.0,7.0,7,22,17.0,39,F
39,022-14-110107,BS(CS),Sania Iqbal,28,4.0,4.0,4,9.0,11.0,11,43,25.0,68,C
40,022-14-110584,BS(CS),Sharif Taqi,27,9.0,6.0,9,8.0,10.0,10,46,35.0,81,A
41,022-14-110225,BS(CS),Shariqa Ahmad,20,7.0,6.0,7,8.0,10.0,10,37,20.0,57,F
42,022-14-110587,BS(CS),Sumbul Rehman,28,5.0,6.0,6,8.0,10.0,10,44,23.0,67,C
43,022-14-110451,BS(CS),Syed Faizan Uddin,28,9.0,4.0,9,6.0,8.0,8,45,34.0,79,B
44,022-14-110589,BS(CS),Syed Sohaib,25,7.0,5.0,7,9.0,NaN,9,41,22.0,63,C
45,022-14-110400,BS(CS),Syeda Sabika Raza,27,9.0,6.0,9,9.0,NaN,9,45,35.0,80,A
46,022-14-19911,BS(CS),Usman Khan,25,8.0,5.0,8,8.0,10.0,10,43,22.0,65,C
47,022-14-110219,BS(CS),Waqar Ahmed,11,9.0,5.0,9,5.0,7.0,7,27,19.0,46,F

In [12]:
df21=pd.read_csv('TAXRATES1.csv',header=None)
df21

,0,1,2,3,4,5,6,7,8,9
0,NaN,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate,RiskLevel
1,0.0,AK,one,ANCHORAGE BOROUGH,0,0,0,NaN,0,1
2,1.0,AK,one,ANCHORAGE BOROUGH,0,NaN,0,0,0,2
3,2.0,AK,two,ANCHORAGE BOROUGH,0,0,NaN,0,NaN,3
4,3.0,AK,two,ANCHORAGE BOROUGH,NaN,0,0,0,0,4

In [13]:
pd.read_csv('TAXRATES1.csv',names=['a','b','c','d','e'])

,,,,,a,b,c,d,e
NaN,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate,RiskLevel
0.0,AK,one,ANCHORAGE BOROUGH,0,0,0,NaN,0,1
1.0,AK,one,ANCHORAGE BOROUGH,0,NaN,0,0,0,2
2.0,AK,two,ANCHORAGE BOROUGH,0,0,NaN,0,NaN,3
3.0,AK,two,ANCHORAGE BOROUGH,NaN,0,0,0,0,4

In [14]:
pd.read_csv('TAXRATES1.csv',names=['a','b','c','d','e','f','g','h','i','risk'],index_col='risk')

,a,b,c,d,e,f,g,h,i
risk,,,,,,,,,
RiskLevel,NaN,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate
1,0.0,AK,one,ANCHORAGE BOROUGH,0,0,0,NaN,0
2,1.0,AK,one,ANCHORAGE BOROUGH,0,NaN,0,0,0
3,2.0,AK,two,ANCHORAGE BOROUGH,0,0,NaN,0,NaN
4,3.0,AK,two,ANCHORAGE BOROUGH,NaN,0,0,0,0

In [15]:
pd.read_csv('TAXRATES1.csv',names=['a','b','c','d','e','f','g','h','i','risk'],index_col='risk',header=None)

,a,b,c,d,e,f,g,h,i
risk,,,,,,,,,
RiskLevel,NaN,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate
1,0.0,AK,one,ANCHORAGE BOROUGH,0,0,0,NaN,0
2,1.0,AK,one,ANCHORAGE BOROUGH,0,NaN,0,0,0
3,2.0,AK,two,ANCHORAGE BOROUGH,0,0,NaN,0,NaN
4,3.0,AK,two,ANCHORAGE BOROUGH,NaN,0,0,0,0

In [16]:
df22=pd.read_csv('TAXRATES1.csv',index_col=['ZipCode','RiskLevel'])
df22

                   Unnamed: 0 State      TaxRegionName  StateRate  \
ZipCode RiskLevel
one     1                   0    AK  ANCHORAGE BOROUGH        0.0
        2                   1    AK  ANCHORAGE BOROUGH        0.0
two     3                   2    AK  ANCHORAGE BOROUGH        0.0
        4                   3    AK  ANCHORAGE BOROUGH        NaN

                   EstimatedCombinedRate  EstimatedCountyRate  \
ZipCode RiskLevel
one     1                            0.0                  0.0
        2                            NaN                  0.0
two     3                            0.0                  NaN
        4                            0.0                  0.0

                   EstimatedCityRate  EstimatedSpecialRate
ZipCode RiskLevel
one     1                        NaN                   0.0
        2                        0.0                   0.0
two     3                        0.0                   NaN
        4                        0.0                   0.0

In [12]:
list(open('text1.txt'))

['A B C D\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb 0.927272 0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382 1.100491']

In [13]:
df23 = pd.read_table('text1.txt', sep='\s+')
df23

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

     A         B         C         D
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [16]:
df24=pd.read_table('text2.txt',skiprows=[0,3])
df24
#originally text2 contains
#####Hello people
a b c d
1 2 3 4
#Good morning
5 6 7 8

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

   a b c d
0  1 2 3 4
1  5 6 7 8

In [17]:
df25=pd.read_table('text3.txt',sep='\s+')
df25

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     NaN

In [18]:
df25.isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False     True

In [19]:
df25.notnull()

   something     a     b     c     d  message
0       True  True  True  True  True    False
1       True  True  True  True  True     True
2       True  True  True  True  True    False

In [23]:
#Missing data is usually either not present (empty string) or marked by some sentinel value. By default,
#pandas uses a set of commonly occurring sentinels, such as NA and NULL
df26 = pd.read_csv('TAXRATES1.csv', na_values=['NULL'])
df26

,Unnamed: 0,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate,RiskLevel
0,0,AK,one,ANCHORAGE BOROUGH,0.0,0.0,0.0,NaN,0.0,1
1,1,AK,one,ANCHORAGE BOROUGH,0.0,NaN,0.0,0.0,0.0,2
2,2,AK,two,ANCHORAGE BOROUGH,0.0,0.0,NaN,0.0,NaN,3
3,3,AK,two,ANCHORAGE BOROUGH,NaN,0.0,0.0,0.0,0.0,4

In [28]:
sentinels = {'A': ['bbb', 'ddd']}
sentinels

{'A': ['bbb', 'ddd']}

In [34]:
df27=pd.read_table('text1.txt',na_values=sentinels,sep='\s+')
df27

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

     A         B         C         D
0  aaa -0.264438 -1.026059 -0.619500
1  NaN  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  NaN -0.871858 -0.348382  1.100491

In [51]:
pd.options.display.max_rows=10

In [52]:
df27

     A         B         C         D
0  aaa -0.264438 -1.026059 -0.619500
1  NaN  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  NaN -0.871858 -0.348382  1.100491

In [57]:
df28=pd.read_csv('jTeOBO.csv',nrows=5)
df28

,Student Code,Degree,Student Name,Mid,Quiz 1,Quiz 2,Best of Quizzes,Assignment 1,Assignment 2,Best of Assignments,Total Sessional (50),Final (50),Total (100),Grade
0,022-14-19987,BS(CS),Abdul Basit,28,8.0,3,8,7.0,9,9,45,25,70,B
1,022-14-110233,BS(CS),Adeel Ahmed,17,NaN,5,5,8.0,10,10,32,18,50,F
2,022-14-110585,BS(CS),Afrah Zareen,18,5.0,2,5,8.0,10,10,33,30,63,C
3,022-14-19718,BS(CS),Ahmed Ali Raza,14,7.0,2,7,NaN,2,2,23,23,46,F
4,022-14-110648,BS(CS),Ahsan Ali Vohra,27,7.0,6,7,7.0,9,9,43,34,77,B

## Writing data to text format

In [63]:
df28.to_csv('jTeOBO.csv')
!cat jTeOBO.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [64]:
import sys
df28.to_csv(sys.stdout,sep='|')

|Student Code|Degree|Student Name|Mid|Quiz 1|Quiz 2|Best of Quizzes|Assignment 1|Assignment 2|Best of Assignments|Total Sessional (50)|Final (50)|Total (100)|Grade
0|022-14-19987|BS(CS)|Abdul Basit|28|8.0|3|8|7.0|9|9|45|25|70|B
1|022-14-110233|BS(CS)|Adeel Ahmed|17||5|5|8.0|10|10|32|18|50|F
2|022-14-110585|BS(CS)|Afrah Zareen|18|5.0|2|5|8.0|10|10|33|30|63|C
3|022-14-19718|BS(CS)|Ahmed Ali Raza|14|7.0|2|7||2|2|23|23|46|F
4|022-14-110648|BS(CS)|Ahsan Ali Vohra|27|7.0|6|7|7.0|9|9|43|34|77|B

In [66]:
df28.to_csv(sys.stdout, na_rep='NULL')

,Student Code,Degree,Student Name,Mid,Quiz 1,Quiz 2,Best of Quizzes,Assignment 1,Assignment 2,Best of Assignments,Total Sessional (50),Final (50),Total (100),Grade
0,022-14-19987,BS(CS),Abdul Basit,28,8.0,3,8,7.0,9,9,45,25,70,B
1,022-14-110233,BS(CS),Adeel Ahmed,17,NULL,5,5,8.0,10,10,32,18,50,F
2,022-14-110585,BS(CS),Afrah Zareen,18,5.0,2,5,8.0,10,10,33,30,63,C
3,022-14-19718,BS(CS),Ahmed Ali Raza,14,7.0,2,7,NULL,2,2,23,23,46,F
4,022-14-110648,BS(CS),Ahsan Ali Vohra,27,7.0,6,7,7.0,9,9,43,34,77,B

In [67]:
#both the row and column labels are written. Both of these can be disabled
df28

,Student Code,Degree,Student Name,Mid,Quiz 1,Quiz 2,Best of Quizzes,Assignment 1,Assignment 2,Best of Assignments,Total Sessional (50),Final (50),Total (100),Grade
0,022-14-19987,BS(CS),Abdul Basit,28,8.0,3,8,7.0,9,9,45,25,70,B
1,022-14-110233,BS(CS),Adeel Ahmed,17,NaN,5,5,8.0,10,10,32,18,50,F
2,022-14-110585,BS(CS),Afrah Zareen,18,5.0,2,5,8.0,10,10,33,30,63,C
3,022-14-19718,BS(CS),Ahmed Ali Raza,14,7.0,2,7,NaN,2,2,23,23,46,F
4,022-14-110648,BS(CS),Ahsan Ali Vohra,27,7.0,6,7,7.0,9,9,43,34,77,B

In [69]:
df28.to_csv(sys.stdout, header=None , index=None)

022-14-19987,BS(CS),Abdul Basit,28,8.0,3,8,7.0,9,9,45,25,70,B
022-14-110233,BS(CS),Adeel Ahmed,17,,5,5,8.0,10,10,32,18,50,F
022-14-110585,BS(CS),Afrah Zareen,18,5.0,2,5,8.0,10,10,33,30,63,C
022-14-19718,BS(CS),Ahmed Ali Raza,14,7.0,2,7,,2,2,23,23,46,F
022-14-110648,BS(CS),Ahsan Ali Vohra,27,7.0,6,7,7.0,9,9,43,34,77,B

In [70]:
df28.to_csv(sys.stdout, header=False , index=False)

022-14-19987,BS(CS),Abdul Basit,28,8.0,3,8,7.0,9,9,45,25,70,B
022-14-110233,BS(CS),Adeel Ahmed,17,,5,5,8.0,10,10,32,18,50,F
022-14-110585,BS(CS),Afrah Zareen,18,5.0,2,5,8.0,10,10,33,30,63,C
022-14-19718,BS(CS),Ahmed Ali Raza,14,7.0,2,7,,2,2,23,23,46,F
022-14-110648,BS(CS),Ahsan Ali Vohra,27,7.0,6,7,7.0,9,9,43,34,77,B

In [75]:
df28.to_csv(sys.stdout, index=False, columns=[1,2,3,4,5,6,7,8,9,10,11,12,13,14])

KeyError: "None of [Int64Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], dtype='int64')] are in the [columns]"

## Working with delimited formats

In [7]:
import csv
f=open('jTeOBO.csv')
reader=csv.reader(f)
for line in reader:
    print(line)

['', 'Student Code', 'Degree', 'Student Name', 'Mid', 'Quiz 1', 'Quiz 2', 'Best of Quizzes', 'Assignment 1', 'Assignment 2', 'Best of Assignments', 'Total Sessional (50)', 'Final (50)', 'Total (100)', 'Grade']
['0', '022-14-19987', 'BS(CS)', 'Abdul Basit', '28', '8.0', '3', '8', '7.0', '9', '9', '45', '25', '70', 'B']
['1', '022-14-110233', 'BS(CS)', 'Adeel Ahmed', '17', '', '5', '5', '8.0', '10', '10', '32', '18', '50', 'F']
['2', '022-14-110585', 'BS(CS)', 'Afrah Zareen', '18', '5.0', '2', '5', '8.0', '10', '10', '33', '30', '63', 'C']
['3', '022-14-19718', 'BS(CS)', 'Ahmed Ali Raza', '14', '7.0', '2', '7', '', '2', '2', '23', '23', '46', 'F']
['4', '022-14-110648', 'BS(CS)', 'Ahsan Ali Vohra', '27', '7.0', '6', '7', '7.0', '9', '9', '43', '34', '77', 'B']

In [8]:
reader

In [21]:
header,value=line[0],line[1:]
header

'4'

In [22]:
value

['022-14-110648',
 'BS(CS)',
 'Ahsan Ali Vohra',
 '27',
 '7.0',
 '6',
 '7',
 '7.0',
 '9',
 '9',
 '43',
 '34',
 '77',
 'B']

In [23]:
reader1=csv.reader('jTeOBO.csv',delimiter='|')
reader1

In [27]:
#To convert a JSON string to Python form, use json.loads
import json
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
result1=json.loads(obj)
result1

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [29]:
#json.dumps, on the other hand, converts a Python object back to JSON
json.dumps(result1)

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [30]:
siblings=pd.DataFrame(result1['siblings'],columns=['name','age','pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

## 6.2 Binary Data Formats

In [33]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [43]:
df29=pd.DataFrame({'a':[1,2,3,4],'b':[5,6,7,8]})
df29

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

In [49]:
writer=pd.ExcelWriter('abc.xlsx')
df30=df29.to_excel(writer,'Sheet1')
writer.save()

In [52]:
df29.to_excel('abc.xlsx')

## 6.3 Interating with web APIs

## 6.4 Interacting with Databases

# CHAPTER 7 Data Cleaning and Preparation

## 7.1 Handling Missing Data

In [69]:
df31 = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
df31

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

#### checking the index of null

In [70]:
df31.isnull()

0    False
1    False
2     True
3    False
dtype: bool

#### Making data to be null

In [71]:
from numpy import nan as NA

In [72]:
df31[0]=NA

In [73]:
df31.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### Filling the NA values

In [74]:
df31.fillna=0
df31

0          NaN
1    artichoke
2          NaN
3      avocado
dtype: object

#### Dropping Na values row or column

In [75]:
df31.dropna()

1    artichoke
3      avocado
dtype: object

## Filtering Out Missing Data

In [76]:
df31

0          NaN
1    artichoke
2          NaN
3      avocado
dtype: object

In [77]:
df31[df31.notnull()]

1    artichoke
3      avocado
dtype: object

In [78]:
df31[df31.isnull()]

0    NaN
2    NaN
dtype: object

In [82]:
df32=pd.DataFrame([[1,2,3],[4,5,NA],[NA,8,9]],columns=['a','b','c'],index=['X','Y','Z'])
df32

     a  b    c
X  1.0  2  3.0
Y  4.0  5  NaN
Z  NaN  8  9.0

In [83]:
cleaned=df32.dropna()

In [84]:
cleaned

     a  b    c
X  1.0  2  3.0

In [86]:
#how='all' drops NA row or column when all values in that columns are null
cleaned1=df32.dropna(how='all')
cleaned1

     a  b    c
X  1.0  2  3.0
Y  4.0  5  NaN
Z  NaN  8  9.0

In [87]:
#how='any' drops NA row or column when any value in that columns is null
cleaned2=df32.dropna(how='any')
cleaned2

     a  b    c
X  1.0  2  3.0

In [89]:
cleaned3=df32.dropna(how='any',axis=1)
cleaned3

   b
X  2
Y  5
Z  8

In [98]:
df33=pd.DataFrame(np.random.randn(7,3),columns=['a','b','c'])
df33

          a         b         c
0  1.836708 -0.466873  0.250816
1 -0.640667 -0.156625  0.228646
2 -0.409561 -1.107290 -0.040964
3  1.481160 -0.807486  0.859790
4  0.536196 -0.057464  1.252705
5  0.336079 -1.087704 -0.165087
6  1.072774  0.549955  0.454594

#### Making values of dataframe to be null

In [99]:
df33.loc[0:3,'a']=NA
df33

          a         b         c
0       NaN -0.466873  0.250816
1       NaN -0.156625  0.228646
2       NaN -1.107290 -0.040964
3       NaN -0.807486  0.859790
4  0.536196 -0.057464  1.252705
5  0.336079 -1.087704 -0.165087
6  1.072774  0.549955  0.454594

In [101]:
df33.loc[3:6,'b']=NA
df33

          a         b         c
0       NaN -0.466873  0.250816
1       NaN -0.156625  0.228646
2       NaN -1.107290 -0.040964
3       NaN       NaN  0.859790
4  0.536196       NaN  1.252705
5  0.336079       NaN -0.165087
6  1.072774       NaN  0.454594

In [106]:
df33.dropna(axis=1)

          c
0  0.250816
1  0.228646
2 -0.040964
3  0.859790
4  1.252705
5 -0.165087
6  0.454594

In [111]:
#thresh will make the values again NA that we make some other value
df33.dropna(thresh=1)

          a         b         c
0       NaN -0.466873  0.250816
1       NaN -0.156625  0.228646
2       NaN -1.107290 -0.040964
3       NaN       NaN  0.859790
4  0.536196       NaN  1.252705
5  0.336079       NaN -0.165087
6  1.072774       NaN  0.454594

## Filling In Missing Data

In [112]:
df33.fillna(0)

          a         b         c
0  0.000000 -0.466873  0.250816
1  0.000000 -0.156625  0.228646
2  0.000000 -1.107290 -0.040964
3  0.000000  0.000000  0.859790
4  0.536196  0.000000  1.252705
5  0.336079  0.000000 -0.165087
6  1.072774  0.000000  0.454594

In [113]:
df33

          a         b         c
0       NaN -0.466873  0.250816
1       NaN -0.156625  0.228646
2       NaN -1.107290 -0.040964
3       NaN       NaN  0.859790
4  0.536196       NaN  1.252705
5  0.336079       NaN -0.165087
6  1.072774       NaN  0.454594

In [115]:
df33.fillna({'a':1.5,'b':9})

          a         b         c
0  1.500000 -0.466873  0.250816
1  1.500000 -0.156625  0.228646
2  1.500000 -1.107290 -0.040964
3  1.500000  9.000000  0.859790
4  0.536196  9.000000  1.252705
5  0.336079  9.000000 -0.165087
6  1.072774  9.000000  0.454594

In [116]:
df33.fillna(method='ffill')

          a         b         c
0       NaN -0.466873  0.250816
1       NaN -0.156625  0.228646
2       NaN -1.107290 -0.040964
3       NaN -1.107290  0.859790
4  0.536196 -1.107290  1.252705
5  0.336079 -1.107290 -0.165087
6  1.072774 -1.107290  0.454594

In [117]:
df33.fillna(method='bfill')

          a         b         c
0  0.536196 -0.466873  0.250816
1  0.536196 -0.156625  0.228646
2  0.536196 -1.107290 -0.040964
3  0.536196       NaN  0.859790
4  0.536196       NaN  1.252705
5  0.336079       NaN -0.165087
6  1.072774       NaN  0.454594

In [120]:
#limit=2  will fill only two next NA values
df33.fillna(method='bfill',limit=2)

          a         b         c
0       NaN -0.466873  0.250816
1       NaN -0.156625  0.228646
2  0.536196 -1.107290 -0.040964
3  0.536196       NaN  0.859790
4  0.536196       NaN  1.252705
5  0.336079       NaN -0.165087
6  1.072774       NaN  0.454594

In [121]:
df33.mean()

a    0.648350
b   -0.576929
c    0.405786
dtype: float64

In [123]:
df33.fillna(df33.mean())

          a         b         c
0  0.648350 -0.466873  0.250816
1  0.648350 -0.156625  0.228646
2  0.648350 -1.107290 -0.040964
3  0.648350 -0.576929  0.859790
4  0.536196 -0.576929  1.252705
5  0.336079 -0.576929 -0.165087
6  1.072774 -0.576929  0.454594

## 7.2 Data Transformation

In [135]:
df34=pd.DataFrame({'a':[1,3]*3+[3],'b':[1,2,3,4,5,6,6]})
df34

   a  b
0  1  1
1  3  2
2  1  3
3  3  4
4  1  5
5  3  6
6  3  6

#### checking the rows that are same(duplicate)

In [137]:
df34.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [134]:
#drop_duplicate drop duplicate rows
df34.drop_duplicates()

   a  b
0  1  1
1  3  2
2  1  3
3  3  4
4  1  5
5  3  6

In [138]:
df34['letters']=['A','B','C','D','E','F','G']

In [139]:
df34

   a  b letters
0  1  1       A
1  3  2       B
2  1  3       C
3  3  4       D
4  1  5       E
5  3  6       F
6  3  6       G

In [141]:
#this code will drop the duplicates of a and b column
df34.drop_duplicates(['a','b'])

   a  b letters
0  1  1       A
1  3  2       B
2  1  3       C
3  3  4       D
4  1  5       E
5  3  6       F

In [142]:
#keep=last will keep the lat row and drop its above row
df34.drop_duplicates(['a','b'],keep='last')

   a  b letters
0  1  1       A
1  3  2       B
2  1  3       C
3  3  4       D
4  1  5       E
6  3  6       G

## Transforming Data Using a Function or Mapping

In [143]:
df35 = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 
                              'honey ham', 'nova lox'],
                              'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
df35

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [144]:
meat_to_animal={
                'bacon': 'pig',
                'pulled pork': 'pig',
                'pastrami': 'cow',
                'corned beef': 'cow',
                'honey ham': 'pig',
                'nova lox': 'salmon'
                }
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [148]:
lowercased=df35['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [151]:
df35['animal']=lowercased.map(meat_to_animal)

In [152]:
df35

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [154]:
df35['animal1']=df35['food'].map(lambda x:meat_to_animal[x.lower()])
df35

          food  ounces  animal animal1
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

## Replacing Values

In [160]:
df36 = pd.Series([1., -999., 2., -999., -1000., 3.])
df36

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [163]:
df36.replace(-1000,NA)

0      1.0
1   -999.0
2      2.0
3   -999.0
4      NaN
5      3.0
dtype: float64

In [166]:
df36.replace([-1000,-999],0)

0    1.0
1    0.0
2    2.0
3    0.0
4    0.0
5    3.0
dtype: float64

In [168]:
df36.replace([-1000,-999],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [169]:
df36.replace({-999:0,-1000:1})

0    1.0
1    0.0
2    2.0
3    0.0
4    1.0
5    3.0
dtype: float64

In [170]:
#The argument passed can also be a dict
df36

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [179]:
df37=pd.DataFrame(np.arange(16).reshape(4,4),index=['one','two','three','four'],columns=[1,2,3,4])
df37

        1   2   3   4
one     0   1   2   3
two     4   5   6   7
three   8   9  10  11
four   12  13  14  15

In [173]:
transform=lambda x: x[:].upper()
transform

In [180]:
df37.index=df37.index.map(transform)

In [181]:
df37

        1   2   3   4
ONE     0   1   2   3
TWO     4   5   6   7
THREE   8   9  10  11
FOUR   12  13  14  15

In [183]:
df37.columns=['aaa','bbb','ccc','ddd']

In [184]:
df37

       aaa  bbb  ccc  ddd
ONE      0    1    2    3
TWO      4    5    6    7
THREE    8    9   10   11
FOUR    12   13   14   15

In [185]:
df37.rename(index=str.title,columns=str.upper)

       AAA  BBB  CCC  DDD
One      0    1    2    3
Two      4    5    6    7
Three    8    9   10   11
Four    12   13   14   15

In [188]:
df37.rename(index={'THREE':'HELLO'},columns={'ccc':'WORLD'})

       aaa  bbb  WORLD  ddd
ONE      0    1      2    3
TWO      4    5      6    7
HELLO    8    9     10   11
FOUR    12   13     14   15

In [189]:
df37

       aaa  bbb  ccc  ddd
ONE      0    1    2    3
TWO      4    5    6    7
THREE    8    9   10   11
FOUR    12   13   14   15

In [190]:
df37.rename(index={'THREE':'HELLO'},columns={'ccc':'WORLD'},inplace=True)

In [191]:
df37

       aaa  bbb  WORLD  ddd
ONE      0    1      2    3
TWO      4    5      6    7
HELLO    8    9     10   11
FOUR    12   13     14   15

In [24]:
s20=pd.Series=[18,34,65,23,78,97,36,22]
s20

[18, 34, 65, 23, 78, 97, 36, 22]

In [25]:
bins=[10,20,40,60,80,100]
a=pd.cut(s20,bins)
a

[(10, 20], (20, 40], (60, 80], (20, 40], (60, 80], (80, 100], (20, 40], (20, 40]]
Categories (5, interval[int64]): [(10, 20] < (20, 40] < (40, 60] < (60, 80] < (80, 100]]

In [26]:
a.codes

array([0, 1, 3, 1, 3, 4, 1, 1], dtype=int8)

In [27]:
a.categories

IntervalIndex([(10, 20], (20, 40], (40, 60], (60, 80], (80, 100]],
              closed='right',
              dtype='interval[int64]')

In [16]:
s21=[120,354,578,435,240]
bin1=[100,200,300,400,500,600]
pd.cut(s21,bin1)

[(100, 200], (300, 400], (500, 600], (400, 500], (200, 300]]
Categories (5, interval[int64]): [(100, 200] < (200, 300] < (300, 400] < (400, 500] < (500, 600]]

In [30]:
pd.value_counts(s20)

78    1
34    1
22    1
23    1
97    1
36    1
18    1
65    1
dtype: int64

In [32]:
ages=[12,45,53,23,34]
group_names=['Child','Youth','YoungAdult','MiddleAged','Senior']
bins=[5,18,25,35,60,100]
pd.cut(ages,bins,labels=group_names)

[Child, MiddleAged, MiddleAged, Youth, YoungAdult]
Categories (5, object): [Child < Youth < YoungAdult < MiddleAged < Senior]

In [55]:
data=np.random.randn(20)
data=abs(data)

In [56]:
pd.cut(data,4,precision=2)

[(0.56, 1.11], (1.11, 1.66], (0.0057, 0.56], (0.56, 1.11], (0.0057, 0.56], ..., (1.11, 1.66], (0.56, 1.11], (1.11, 1.66], (0.0057, 0.56], (1.66, 2.2]]
Length: 20
Categories (4, interval[float64]): [(0.0057, 0.56] < (0.56, 1.11] < (1.11, 1.66] < (1.66, 2.2]]

In [57]:
#for normal distribution, we use np.random.randn()
#for quartile cut we 'use cutq

## Detecting and Filtering Outliers

In [63]:
data

TypeError: 'list' object is not callable

,0,1,2,3
0,-1.096820,0.318019,0.332952,-1.147434
1,-1.216948,0.719147,-0.231264,-0.097770
2,0.140219,0.171398,-0.781692,-0.505841
3,0.524132,-1.455815,0.850078,0.723036
4,0.975060,0.925384,-0.288173,-0.223190
5,0.385807,-0.569648,-0.831366,0.359521
6,-0.985873,0.546267,-1.240898,0.271242
7,-0.445603,-0.772561,-1.166429,0.842623
8,-2.210182,1.408993,-1.721264,1.122281
9,-1.063564,1.166728,-1.019749,0.977089
10,0.992084,-0.862207,-0.856780,1.086510
11,-0.474832,-0.178296,1.173661,-0.325076
12,1.263231,0.561924,-0.528848,0.618389
13,-1.048336,0.154451,0.363970,0.609512
14,0.705253,0.581923,0.157136,-1.127647
15,-0.977716,-0.652679,-0.108415,-0.453983
16,-0.051903,-0.454673,0.466391,1.313776
17,0.824795,-1.007012,3.046138,-0.993472
18,-1.207819,0.003434,1.438887,0.768365
19,0.367221,0.515931,-0.067531,0.213638
20,1.470223,1.364830,-1.452106,0.147868
21,-0.838124,0.333858,-0.694172,0.164632
22,-0.073816,1.491554,-0.597321,-0.572311
23,-0.288485,-1.998988,-1.016775,1.028210
24,-0.937834,1.548690,-0.480475,-0.396422
25,1.130669,-0.048019,-0.350202,0.091082
26,0.750771,-2.859521,0.255284,-1.266340
27,-0.944341,-0.095395,-1.174755,-1.294232
28,-0.120484,-0.035221,0.093393,0.731318
29,1.365750,1.083380,1.626587,1.562101
...,...,...,...,...
970,-2.580696,-0.643134,-0.332373,-1.056959
971,-0.295446,1.217852,-0.615422,1.718527
972,0.277655,1.108462,0.857677,-1.660937
973,1.299942,0.906604,-0.085753,-1.140130
974,-0.574113,0.594241,0.367246,-0.319342
975,0.400490,1.432951,-1.217897,0.148585
976,1.077880,0.939605,0.989576,-0.812949
977,0.034889,-0.019774,0.891648,0.866206
978,0.746934,1.598248,0.632633,-0.957631
979,-0.424030,1.970727,0.583331,-0.239841
980,-0.501898,-0.626285,-1.054584,-0.827734
981,1.984992,0.992319,-1.246777,-0.225540
982,0.876806,-0.008333,-0.049839,0.259582
983,-0.965639,-0.901051,-0.625770,0.191972
984,-0.337595,-0.593739,1.454967,1.152804
985,-0.376707,1.503794,1.136197,1.916733
986,-2.020915,-0.962143,-0.384883,-0.164490
987,0.075110,-0.665517,0.981976,-0.058212
988,-0.225133,-0.219729,0.793955,-0.064622
989,-0.264198,-0.667611,-0.568824,0.956799
990,-0.232298,-0.375925,0.854000,3.370134
991,0.409570,0.582575,0.574591,-0.131782
992,-2.146486,1.427375,-0.240951,-2.015656
993,1.372065,1.086338,-1.184149,2.360332
994,0.740839,-1.502699,-1.207099,1.070733
995,0.087345,-1.604711,0.676091,0.706258
996,-0.635214,-2.109795,0.411105,1.082502
997,-1.260556,0.697746,-0.657490,1.341812
998,-0.271345,1.154448,-0.688292,1.037200
999,0.297674,-0.098835,0.877912,-0.519170

In [3]:
df38=pd.DataFrame(np.arange(12).reshape(3,4),index=[1,2,3],columns=['a','b','c','d'])
df38

   a  b   c   d
1  0  1   2   3
2  4  5   6   7
3  8  9  10  11

In [6]:
import re

In [11]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [12]:
regex = re.compile(pattern, flags=re.IGNORECASE)
regex

re.compile(r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}', re.IGNORECASE|re.UNICODE)

In [13]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']